In [1]:
import pandas

In [2]:
pandas

In [6]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [7]:
data = Series([5, 4, 3, -1, 9])

In [8]:
data

0    5
1    4
2    3
3   -1
4    9
dtype: int64

In [10]:
type(data.values)

numpy.ndarray

In [11]:
data.index

RangeIndex(start=0, stop=5, step=1)

In [14]:
data = [5, 4, 3, -1, 9]
data2 = Series(data, index=['a', 'b', 'c', 'd', 'e'])

In [15]:
data2

a    5
b    4
c    3
d   -1
e    9
dtype: int64

In [16]:
data2.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [17]:
data2['a']

5

In [18]:
data2.c

3

In [20]:
np.sum(data2[['a','b','c']])

12

In [21]:
np.sqrt(data2[['a','b']])

a    2.236068
b    2.000000
dtype: float64

In [22]:
data2[data2>3]

a    5
b    4
e    9
dtype: int64

In [23]:
data2 + 10

a    15
b    14
c    13
d     9
e    19
dtype: int64

In [25]:
for value in data2:
    print(value)

5
4
3
-1
9

In [35]:
product_and_price = {'choco_ball':2500, 'gum':700, 'bbabbaro': 1700, 'sacomdalcom':500}

In [36]:
product_and_price

{'choco_ball': 2500, 'gum': 700, 'bbabbaro': 1700, 'sacomdalcom': 500}

In [39]:
product_series = Series(product_and_price, index=['gum', 'choco_ball', 'sacomdalcom', 'bbabbaro'])

In [40]:
product_series

gum             700
choco_ball     2500
sacomdalcom     500
bbabbaro       1700
dtype: int64

In [42]:
product_series = Series(product_and_price)

In [44]:
product_series.isnull()

bbabbaro       False
choco_ball     False
gum            False
sacomdalcom    False
dtype: bool

In [45]:
product_series.notnull()

bbabbaro       True
choco_ball     True
gum            True
sacomdalcom    True
dtype: bool

In [46]:
product_series[product_series.isnull()] = 0

In [47]:
product_series

bbabbaro       1700
choco_ball     2500
gum             700
sacomdalcom     500
dtype: int64

In [48]:
product_series.name = "price"

In [49]:
product_series

bbabbaro       1700
choco_ball     2500
gum             700
sacomdalcom     500
Name: price, dtype: int64

In [50]:
product_series.index.name = "product name"

In [51]:
product_series

product name
bbabbaro       1700
choco_ball     2500
gum             700
sacomdalcom     500
Name: price, dtype: int64

In [54]:
product_series.astype(np.int)

product name
bbabbaro       1700
choco_ball     2500
gum             700
sacomdalcom     500
Name: price, dtype: int64

In [58]:
product_series2 = product_series.reindex(['choco_ball', 'gum', 'bbabbaro', 'sacomdalcom'])

In [59]:
product_series

product name
bbabbaro       1700
choco_ball     2500
gum             700
sacomdalcom     500
Name: price, dtype: int64

In [60]:
product_series2

product name
choco_ball     2500
gum             700
bbabbaro       1700
sacomdalcom     500
Name: price, dtype: int64

In [62]:
product_series3 = product_series2.drop('gum')

In [67]:
product_series3

product name
choco_ball     2500
bbabbaro       1700
sacomdalcom     500
Name: price, dtype: int64

In [69]:
product_series3['bbabbaro':'sacomdalcom'] = 1000

In [70]:
product_series3

product name
choco_ball     2500
bbabbaro       1000
sacomdalcom    1000
Name: price, dtype: int64

In [71]:
data = {
    'name': ['choco_ball', 'gum', 'photo_chip', 'bbabbarp'],
    'price': [1600, 700, 2500, 2000],
    'made': ['a','a','b','c']
}

In [78]:
df = DataFrame(data, columns=['name', 'price', 'made'], index=[1,2,3,4])

In [79]:
df

         name  price made
1  choco_ball   1600    a
2         gum    700    a
3  photo_chip   2500    b
4    bbabbarp   2000    c

In [82]:
df['made']

1    a
2    a
3    b
4    c
Name: made, dtype: object

In [83]:
type(df.price)

pandas.core.series.Series

In [84]:
df.ix[1]

/Library/Frameworks/Python.framework/Versions/3.6/lib/python3.6/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

name     choco_ball
price          1600
made              a
Name: 1, dtype: object

In [85]:
df.ix[1]

name     choco_ball
price          1600
made              a
Name: 1, dtype: object

In [87]:
df[df['price']>1000].name

1    choco_ball
3    photo_chip
4      bbabbarp
Name: name, dtype: object

In [88]:
df['amount'] = 100

In [89]:
df

         name  price made  amount
1  choco_ball   1600    a     100
2         gum    700    a     100
3  photo_chip   2500    b     100
4    bbabbarp   2000    c     100

In [90]:
df.ix[5] = ['sacomdalcom', 600, 'c', '100']

In [91]:
df

          name  price made amount
1   choco_ball   1600    a    100
2          gum    700    a    100
3   photo_chip   2500    b    100
4     bbabbarp   2000    c    100
5  sacomdalcom    600    c    100

In [92]:
df.T

                 1    2           3         4            5
name    choco_ball  gum  photo_chip  bbabbarp  sacomdalcom
price         1600  700        2500      2000          600
made             a    a           b         c            c
amount         100  100         100       100          100

In [97]:
df2 = df.reindex([3, 5, 4, 1, 2])

In [101]:
df3 = df2.reindex(columns = ['amount', 'name', 'price', 'made'])

In [102]:
df3

  amount         name  price made
3    100   photo_chip   2500    b
5    100  sacomdalcom    600    c
4    100     bbabbarp   2000    c
1    100   choco_ball   1600    a
2    100          gum    700    a

In [103]:
df3['name']

3     photo_chip
5    sacomdalcom
4       bbabbarp
1     choco_ball
2            gum
Name: name, dtype: object

In [104]:
df3[['name', 'price']]

          name  price
3   photo_chip   2500
5  sacomdalcom    600
4     bbabbarp   2000
1   choco_ball   1600
2          gum    700

In [105]:
df

          name  price made amount
1   choco_ball   1600    a    100
2          gum    700    a    100
3   photo_chip   2500    b    100
4     bbabbarp   2000    c    100
5  sacomdalcom    600    c    100

In [106]:
df.ix[2, ['name', 'price']]

name     gum
price    700
Name: 2, dtype: object

In [107]:
df.ix[[2,3], ['name', 'price']]

         name  price
2         gum    700
3  photo_chip   2500

In [108]:
df[:3]

         name  price made amount
1  choco_ball   1600    a    100
2         gum    700    a    100
3  photo_chip   2500    b    100

In [109]:
np.sum(df.price)

7400

In [111]:
df = df.drop(2)

In [112]:
df

          name  price made amount
1   choco_ball   1600    a    100
3   photo_chip   2500    b    100
4     bbabbarp   2000    c    100
5  sacomdalcom    600    c    100

In [113]:
df = df.drop('made', axis=1)

In [114]:
df

          name  price amount
1   choco_ball   1600    100
3   photo_chip   2500    100
4     bbabbarp   2000    100
5  sacomdalcom    600    100

In [115]:
df.to_html

<bound method DataFrame.to_html of           name  price amount
1   choco_ball   1600    100
3   photo_chip   2500    100
4     bbabbarp   2000    100
5  sacomdalcom    600    100>